def p1():
    strani = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
              "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
              "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
              "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
              "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(strani)
    a = str(input("Какая страна? "))
    try:
        print(strani[a])
    except KeyError:
        print("Такой страны нет")
    for key in sorted(strani):
        print(key, " - ", strani[key])


def p2():
    alfavit = {
            "авеинорст": 1,
            "дклмпу": 2,
            "бгёья": 3,
            "йы": 4,
            "жзхцч": 5,
            "шэю": 8,
            "фщъ": 10
    }
    w = input("Введите слово: ")
    s = 0
    for i in w:
        for x in alfavit:
            if i in x:
                s += alfavit[x.lower()]
    print("Сумма: ", s)

def p3():
    stud = [
        {"n": "Иван", "l": ["английский", "французский"]},
        {"n": "Коля", "l": ["немецкий", "английский"]},
        {"n": "Оля", "l": ["японский", "китайский", "английский"]},
        {"n": "Алёна", "l": ["итальянский", "французский"]}
    ]
    l = set()
    for student in stud:
        l.update(student["l"])

    s = sorted(l)
    print("Языки: ", s)

    ch = []
    for s in stud:
        if "китайский" in s["l"]:
            ch.append(s["n"])
    print("Китайский:", ch)

p1()
p2()
p3()